#language: ru
Функционал: Проверка корзины

  @all
  @firstTest
  Сценарий: Iphone

    * вводим в поисковую строку "Iphone"


    * страница "ResultPage" загружена

    * "максимальная цена" составляет "100000"
    * выполнено нажатие на "высокий рейтинг"
    * выполнено нажатие на "NFC"

    * убираем первый товар в корзину


  @all
  @secondTest
  Сценарий: беспроводные наушники

    * вводим в поисковую строку "беспроводные наушники"

    * страница "ResultPage" загружена
    * "максимальная цена" составляет "10000"

    * нажимаем "посмотреть все бренды" в поле "найти бренд" выбираем "Xiaomi"
    * в поле "найти бренд" выбираем "Samsung"
    * в поле "найти бренд" выбираем "Beats"
    * выполнено нажатие на "высокий рейтинг"



